[
  {
    "speaker": "Rick",
    "text": "Morty, ever thought about the pain astronomers must feel when their number twos hit a black hole?"
  },
  {
    "speaker": "Morty",
    "text": "Rick, space toilets exist, you know. They recycle your waste into water and oxygen!"
  },
  {
    "speaker": "Rick",
    "text": "Ah, Morty, but what about the molecular restructuring during re-entry? It's a chemical nightmare!"
  },
  {
    "speaker": "Morty",
    "text": "That's why they have separate waste disposal systems, Rick! Solid and liquid are handled differently."
  },
  {
    "speaker": "Rick",
    "text": "Ha! Fools! They're hoping I don't notice that reminders of my meals come back to me as rocket fuel!"
  },
  {
    "speaker": "Morty",
    "text": "Rick, we're not driving a space cadet's car. We have technology to purify waste!"
  },
  {
    "speaker": "Rick",
    "text": "Morty, nothing is ever that simple. Imagine a toilet clogged with a sentient being?"
  },
  {
    "speaker": "Morty",
    "text": "What? Total intergalactic toilet paper designed for any malfunction?"
  },
  {
    "speaker": "Rick",
    "text": "A man can dream, Morty."
  },
  {
    "speaker": "Morty",
    "text": "Rick, we need to talk about the possibility of the toilet paper wrapping around stars."
  },
  {
    "speaker": "Rick",
    "text": "Your mind boggles me, Morty. Stars can't be toilet paper."
  },
  {
    "speaker": "Morty",
    "text": "What if there's intelligent toilet paper? Potty-born civilizations?"
  },
  {
    "speaker": "Rick",
    "text": "We should proceed with extreme caution, Morty, or it may fold us into another dimension."
  },
  {
    "speaker": "Morty",
    "text": "Rick, we're worrying about unintended consequences of… waste disposal. Calm down!"
  },
  {
    "speaker": "Rick",
    "text": "But what about the consequences if the toilet paper has a sense of humor?"
  },
  {
    "speaker": "Morty",
    "text": "I think we both should take a deeper breath and not think about it, Rick."
  },
  {
    "speaker": "Rick",
    "text": "Fine, Morty. But if the spaceship ever veers slightly off course, blame the toilet paper."
  },
  {
    "speaker": "Morty",
    "text": "Space toilets are not that complex, Rick. And neither is potty humor."
  }
]